user_inquiry = int(input("Введите количество секундр, чтобы преобразовать их в минуты и дни."))
year = user_inquiry // 31536000
month = (user_inquiry % 31536000)//2592000
day = (user_inquiry % 31536000)%2592000//86400
hour = ((user_inquiry % 31536000)%2592000%86400)//3600
min  = (((user_inquiry % 31536000)%2592000%86400)%3600)//60
sec = ((((user_inquiry % 31536000)%2592000%86400)%3600)%60)

print(year, " : количество лет  ", month, " : количество месяцев", day, " : количество дней ", hour, " : количество часов ", min, " : количество минут ", sec, " : количество секунд ")

